
&НаКлиенте
Процедура БлокировкаСчета(Команда)

	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		БлокировкаСчетаНаСервере();
	КонецЕсли;

	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура БлокировкаСчетаНаСервере()

	МенеджерЗаписи = РегистрыСведений.ЗаблокированныеСчета.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Счет = Элементы.Список.ТекущаяСтрока;
	МенеджерЗаписи.Прочитать();

	Если МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Удалить();
	Иначе
		МенеджерЗаписи.Счет = Элементы.Список.ТекущаяСтрока;
		МенеджерЗаписи.Записать();
	КонецЕсли;

КонецПроцедуры
