
Процедура ПриЗаписи(Отказ)

	ДатаСоздания = ТекущаяДатаСеанса();

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если НЕ ЭтоНовый() Тогда

		ЕстьИзмененияКлючевыхРеквизитов = Ложь;

		мРеквизиты = Новый Массив;
		мРеквизиты.Добавить("НаименованиеПолное");
		мРеквизиты.Добавить("Сумма");	

		ТекущиеЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, СтрСоединить(мРеквизиты, ", "));

		Для Каждого ИмяРеквизита Из мРеквизиты Цикл
			Если ТекущиеЗначенияРеквизитов[ИмяРеквизита] <> ЭтотОбъект[ИмяРеквизита] Тогда
				ЕстьИзмененияКлючевыхРеквизитов = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Если ЕстьИзмененияКлючевыхРеквизитов Тогда

			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ЗаблокированныеСчета.Счет КАК НовыйСправочник
			|ИЗ
			|	РегистрСведений.ЗаблокированныеСчета КАК ЗаблокированныеСчета
			|ГДЕ
			|	ЗаблокированныеСчета.Счет = &Ссылка";

			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				ТекстСообщения = "Счет заблокирован. Перед изменением ключевых реквизитов, счет необходимо разблокировать.";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,, Отказ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
