#language: ru

@tree

Функционал: Проверка работы справочника "Счета"

Как я хочу создать и заполнить элемент справочника "Счета", 
чтобы внести новое значение    

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Создание, заполнение, запись и блокировка счета
	* Создание нового элемента
		И В командном интерфейсе я выбираю "Новые объекты" "Счета"
		Тогда открылось окно "Счета"
		И я нажимаю на кнопку с именем 'ФормаСоздать'

	*Заполнение справочника
		Тогда открылось окно "Счет (создание)"
		И в поле с именем 'Наименование' я ввожу текст "Счет 1"
		И в поле с именем 'Сумма' я ввожу текст "5000,00"

	*Запись
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		
	*Блокировка счета
		И в таблице "Список" я перехожу к строке
				| 'Наименование' |
				| 'Счет 1' |
		И я нажимаю на кнопку с именем 'ФормаБлокировкаСчета'
		И я закрываю все окна клиентского приложения

Сценарий: Изменение ключевых реквизитов счета (негативный тест)
	* Открытие существующего элемента справочника
		И В командном интерфейсе я выбираю "Новые объекты" "Счета"
		Тогда открылось окно "Счета"
		И в таблице "Список" я перехожу к строке
				| 'Наименование' |
				| 'Счет 1' |
		И я нажимаю на кнопку с именем 'ФормаИзменить'

	*Изменение значения реквизита
		Тогда открылось окно "* (Счет)"
		И в поле с именем 'Наименование' я ввожу текст "Измененный счет 1"
		И в поле с именем 'Сумма' я ввожу текст "2300,00"

	*Запись
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		Тогда открылось окно "1С:Предприятие"
		И я нажимаю на кнопку с именем 'OK'
		Тогда в логе сообщений TestClient есть строки:
			|'Счет заблокирован. Перед изменением ключевых реквизитов, счет необходимо разблокировать.'|
		И я закрываю окно "* (Счет) *"
		Тогда открылось окно "1С:Предприятие"
		И я нажимаю на кнопку "Нет"
		И я закрываю все окна клиентского приложения

Сценарий: Изменение ключевых реквизитов счета
	* Открытие существующего элемента справочника
		И В командном интерфейсе я выбираю "Новые объекты" "Счета"
		Тогда открылось окно "Счета"
		И в таблице "Список" я перехожу к строке
				| 'Наименование' |
				| 'Счет 1' |
		И я нажимаю на кнопку с именем 'ФормаБлокировкаСчета'
		И я нажимаю на кнопку с именем 'ФормаИзменить'

	*Изменение значения реквизита
		Тогда открылось окно "* (Счет)"
		И в поле с именем 'Наименование' я ввожу текст "Измененный счет 1"
		И в поле с именем 'Сумма' я ввожу текст "2300,00"

	*Запись
		И я нажимаю на кнопку с именем 'ФормаЗаписатьИЗакрыть'
		И я закрываю все окна клиентского приложения
					